package management.test;

public class Question {

    /* Java 강의 마무리 과제
     *  자바 컬렉션을 활용한 관리 프로그램 프로젝트를 압축하여 파일로 업로드 하세요.
     *
     * 관리 프로그램에서 구현 되어야 하는 내용은 다음과 같습니다.
     *
     *   1. Collection 자료구조 중 사용할 자료구조를 선택한다. (ArrayList, HashMap 등)
     *
     *   2. 관리 데이터의 DTO 클래스를 만든다. (ProductDTO, MemberDTO, BookDTO 등)
     *
     *   3. 콘솔 입출력을 통해 데이터를 컬렉션 자료구조에 저장할 수 있고,
     *      저장 된 데이터를 조회, 수정, 삭제 할 수 있는 관리 프로그램을 구현한다.
     * */


    /* 컨셉을 뭘로 정할까
     *  일단 1번은 ArrayList 사용 예정바리,,,
     *   최대한 풀어봤던 챕터12 연습문제 하드를 기억해내긔,,,
     *
     *   헬스장 회원 관리 프로그램? -> 회원 이름, 회원 번호, 등록 날짜, 이용 만료 날짜?, 담당 트레이너
     *   저장 -> 신규 회원 저장
     *   조회 -> 회원 이름 혹은 번호 입력시 개인 회원 조회 / 전체 회원 목록
     *   수정 -> 이용 만료 날짜 수정 또는 담당 트레이너 수정
     *   삭제 -> 회원 정보 삭제
     *
     *   운동 수업 예약 관리 프로그램? -> 회원 이름, 회원 번호, 운동 종류 또는 수업 종류,
     *   저장 -> 신규 회원 저장
     *   조회 -> 회원 이름 혹은 번호 입력시 개인 회원 조회 또는 현재 등록한 수업 조회 / 전체 회원 목록 또는 체육관 전체 수업 목록
     *   수정 -> 수강 중인 수업 변경
     *   삭제 -> 회원 정보 삭제
     *
     *   편의점 발주 목록? -> 상품 이름, 상품 번호, 상품 가격, 상품 개수, 냉동 상품 여부(t/f)
     *   저장 -> 발주할 상품 등록
     *   조회 -> 발주 넣은 상품 확인 또는 전체 발주 리스트
     *   수정 -> 발주 넣은 상품 정보 수정 (상품의 개수라던가)
     *   삭제 -> 발주 목록에서 삭제
     *
     *   물건 구매 목록? 기각
     *   */
}
